In [1]:
import datetime as datetime
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import random

# Ejercicio N°1
####  Dado el registro de notas de los alumnos de la forma(padrón,materia,nota,fecha).Se pide resolver utilizando Pandas:

**A**.Cuál es el promedio de notas.

**B**.Cuál es la nota más alta y la nota más baja registrada durante el año 2019.

**C**.Cuál es el padrón con mayor cantidad de materias aprobadas durante el último cuatrimestre.

**D**.Cuál es la nota promedio.

**E**.Cuál es la nota promedio por padrón.

In [2]:
notas = pd.DataFrame({'padron': [99373, 99373, 99281, 101923, 102000, 101923, 99373, 92002, 98483],
                      'materia':['AM3', 'F3', 'AM3', 'AM3', 'F3', 'Taller', 'Taller', 'AM2', 'F1'],
                      'nota': [2,9,5,8,4,7,8,9,4],
                      'fecha':['2019-8-2', '2019-2-14', '2018-12-3', '2019-8-2', '2019-7-23','2019-7-27','2018-12-14','2017-7-27','2016-12-10']})

In [3]:
notas

   padron materia  nota       fecha
0   99373     AM3     2    2019-8-2
1   99373      F3     9   2019-2-14
2   99281     AM3     5   2018-12-3
3  101923     AM3     8    2019-8-2
4  102000      F3     4   2019-7-23
5  101923  Taller     7   2019-7-27
6   99373  Taller     8  2018-12-14
7   92002     AM2     9   2017-7-27
8   98483      F1     4  2016-12-10

In [4]:
notas.info()
notas['fecha'] = pd.to_datetime(notas['fecha'])

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 4 columns):
padron     9 non-null int64
materia    9 non-null object
nota       9 non-null int64
fecha      9 non-null object
dtypes: int64(2), object(2)
memory usage: 416.0+ bytes

**A**.Cuál es el promedio de notas.

In [5]:
notas['nota'].mean()

6.222222222222222

**B**.Cuál es la nota más alta y la nota más baja registrada durante el año 2019.

In [6]:
notas[notas['fecha'].dt.year == 2019]

   padron materia  nota      fecha
0   99373     AM3     2 2019-08-02
1   99373      F3     9 2019-02-14
3  101923     AM3     8 2019-08-02
4  102000      F3     4 2019-07-23
5  101923  Taller     7 2019-07-27

In [7]:
nota_min = notas[notas['fecha'].dt.year == 2019]['nota'].min()
nota_max = notas[notas['fecha'].dt.year == 2019]['nota'].max()

In [8]:
nota_min

2

In [9]:
nota_max

9

**C**.Cuál es el padrón con mayor cantidad de materias aprobadas durante el último cuatrimestre.

In [10]:
notas_fec = notas[notas['fecha'] > '2019-3-1']
max_aprob = notas_fec[notas_fec['nota'] >= 4]['padron'].value_counts().idxmax() #seguir preguntando
max_aprob

101923

**D**.Cuál es la nota promedio.

In [11]:
notas[notas['padron']==max_aprob]['nota'].mean()
# o me pide notas['nota'].value_counts() ?

7.5

**E**.Cuál es la nota promedio por padrón.

In [12]:
notas.groupby('padron').agg({'nota':'mean'}).round(1) #round es para redondear.

        nota
padron
92002    9.0
98483    4.0
99281    5.0
99373    6.3
101923   7.5
102000   4.0

# Ejercicio 2

2- Se tiene un registro de transacciones bancarias, de la forma (nro de transacción, tipo de transacción, cuenta origen, cuenta destino, fecha, hora, monto). Se pide resolver en Pandas:

    A. Validar que todas las transacciones cuenten con un tipo de transacción.
    B. Validar que para las transacciones del tipo transferencia, exista siempre tanto cuenta origen como cuenta destino.
    C. Verificar que todas las transacciones del tipo transferencia, depósito y extracción cuenten con montos distintos de cero.
    D. Indicar cuáles fueron las 10 transacciones de mayor monto.
    E. Indicar cuál es el tipo de transacción que registra mayor monto promedio.
    F. Indicar cuáles son las 5 cuentas con mayor cantidad de transacciones.
    G. Indicar cuáles son las 5 cuentas con mayor monto involucrado.
    H. Para el tipo de transacción con mayor cantidad de monto promedio, indicar cuales son las 5 cuentas con más transacciones.

In [140]:
df_2 = pd.DataFrame(columns = ['nrodetransaccion','tipodetransaccion','cuentaorigen', 'cuentadestino', 'fecha', 'hora', 'monto'])
tipo_de_transacciones = ['transferencia', 'deposito', 'extraccion', None]
cuentas = ['cuenta A', 'cuenta B', 'cuenta C', 'cuenta D', 'cuenta E', 'cuenta F', 'cuenta G', 'cuenta H', None]
fechas = ['2019-9-8','2019-6-11', '2018-2-7', '2018-11-11']
horas = ['10:00:00','12:30:00', '02:00:00', '02:45:00']
for i in range(100):
    df_2 = df_2.append({
        'nrodetransaccion' : (i + 100), 
        'tipodetransaccion' : random.choice(tipo_de_transacciones) , 
        'cuentaorigen' : random.choice(cuentas) , 
        'cuentadestino' : random.choice(cuentas), 
        'fecha' : random.choice(fechas), 
        'hora' : random.choice(horas), 
        'monto' : random.uniform(0, 100)
    }, ignore_index = True)
df_2

,nrodetransaccion,tipodetransaccion,cuentaorigen,cuentadestino,fecha,hora,monto
0,100,extraccion,cuenta D,cuenta F,2018-2-7,02:45:00,92.053214
1,101,extraccion,cuenta D,cuenta C,2019-6-11,02:45:00,93.863535
2,102,deposito,cuenta B,cuenta D,2018-2-7,10:00:00,52.457622
3,103,extraccion,cuenta E,cuenta F,2018-2-7,10:00:00,88.696024
4,104,extraccion,cuenta F,cuenta E,2019-9-8,10:00:00,32.739781
...,...,...,...,...,...,...,...
95,195,transferencia,cuenta G,cuenta E,2019-6-11,12:30:00,47.223704
96,196,extraccion,cuenta H,None,2018-11-11,02:00:00,9.289203
97,197,None,cuenta F,cuenta H,2019-9-8,12:30:00,10.157791
98,198,deposito,cuenta D,cuenta B,2018-2-7,02:45:00,11.354336
99,199,None,cuenta D,cuenta D,2019-6-11,10:00:00,66.462668

In [141]:
#A Devuelve True si alguna de las transacciones no tiene definido el tipo
tipo_de_transacciones = ['transferencia', 'deposito', 'extraccion']
False if ~df_2.tipodetransaccion.isin(tipo_de_transacciones).any() else True

True

In [142]:
df_2[df_2['tipodetransaccion'] == 'transferencia'][['cuentaorigen','cuentadestino']].isna().any()
#Si devuelve true es porque tiene alguna cuenta origen/destino sin cuenta.

cuentaorigen     True
cuentadestino    True
dtype: bool

In [143]:
df_2[df_2['monto'] == 0.00].monto.count() == 0
#Si devuelve True es porque ninguna de las cuentas tiene monto 0

True

In [144]:
df_2.nlargest(10,'monto')

,nrodetransaccion,tipodetransaccion,cuentaorigen,cuentadestino,fecha,hora,monto
91,191,transferencia,cuenta D,None,2018-2-7,10:00:00,99.806832
42,142,deposito,cuenta B,cuenta A,2018-11-11,02:45:00,99.372940
17,117,deposito,cuenta F,cuenta F,2018-2-7,12:30:00,97.682603
7,107,extraccion,cuenta G,cuenta D,2018-2-7,10:00:00,96.823928
16,116,None,cuenta E,cuenta G,2018-11-11,10:00:00,94.260451
31,131,None,cuenta A,cuenta H,2019-9-8,02:00:00,94.181913
1,101,extraccion,cuenta D,cuenta C,2019-6-11,02:45:00,93.863535
26,126,transferencia,cuenta G,cuenta C,2019-9-8,10:00:00,93.733881
80,180,extraccion,cuenta B,cuenta H,2019-6-11,10:00:00,93.352808
0,100,extraccion,cuenta D,cuenta F,2018-2-7,02:45:00,92.053214

In [145]:
df_2.groupby(['tipodetransaccion']).agg({'monto':'mean'}).nlargest(1,'monto')

                      monto
tipodetransaccion
extraccion         60.10086

In [152]:
df_2.cuentaorigen.value_counts().nlargest(5)

cuenta F    16
cuenta D    15
cuenta B    15
cuenta G    12
cuenta E    10
Name: cuentaorigen, dtype: int64

In [155]:
df_2.groupby('cuentaorigen').agg({'monto':'max'}).nlargest(5,'monto')

                  monto
cuentaorigen
cuenta D      99.806832
cuenta B      99.372940
cuenta F      97.682603
cuenta G      96.823928
cuenta E      94.260451

In [194]:
tipo_mayor = df_2.groupby('tipodetransaccion').agg({'monto':'mean'}).idxmax().get('monto')
tipo_mayor #Ver como se puede hacer de otra manera, y evitar el tema del get monto.

'extraccion'

In [196]:
df_2[df_2['tipodetransaccion']==tipo_mayor].cuentaorigen.value_counts().nlargest(5)

cuenta B    7
cuenta D    5
cuenta H    5
cuenta F    3
cuenta A    2
Name: cuentaorigen, dtype: int64

# Ejercicio N°3

In [133]:
productos = pd.DataFrame({'codigodelproducto': [123,124,125,126,127,123,122,123,125,123,126,124],
                          'codigofabricante':[1,2,3,1,2,1,2,2,2,1,1,2],
                          'mes':[1,2,3,12,5,3,6,10,12,2,1,3],
                          'ventasmensuales':[20,10,21,10,21,40,110,9,8,32,30,15]})
productos

    codigodelproducto  codigofabricante  mes  ventasmensuales
0                 123                 1    1               20
1                 124                 2    2               10
2                 125                 3    3               21
3                 126                 1   12               10
4                 127                 2    5               21
5                 123                 1    3               40
6                 122                 2    6              110
7                 123                 2   10                9
8                 125                 2   12                8
9                 123                 1    2               32
10                126                 1    1               30
11                124                 2    3               15

In [14]:
productos.groupby('codigodelproducto').agg({'ventasmensuales':'mean'}).reset_index().rename(columns={'ventasmensuales':'promediodeventas'})

   codigodelproducto  promediodeventas
0                122            110.00
1                123             25.25
2                124             12.50
3                125             14.50
4                126             20.00
5                127             21.00

In [15]:
#A. Promedio por producto con el siguiente formato:
c = productos[['codigodelproducto','ventasmensuales']]
c = c.assign(promedio = productos['ventasmensuales'], maximo = productos['ventasmensuales'], minimo = productos['ventasmensuales'] )
c.groupby('codigodelproducto').agg({'promedio':'mean', 'maximo':'max', 'minimo':'min'}).stack().to_frame().rename(columns = {0:'valor'})

                             valor
codigodelproducto
122               promedio  110.00
                  maximo    110.00
                  minimo    110.00
123               promedio   25.25
                  maximo     40.00
                  minimo      9.00
124               promedio   12.50
                  maximo     15.00
                  minimo     10.00
125               promedio   14.50
                  maximo     21.00
                  minimo      8.00
126               promedio   20.00
                  maximo     30.00
                  minimo     10.00
127               promedio   21.00
                  maximo     21.00
                  minimo     21.00

In [16]:
#B. Mínimo, Máximo y Promedio de ventas por producto con el formato:
c = productos[['codigodelproducto','ventasmensuales']]
c = c.assign(promedio = productos['ventasmensuales'], maximo = productos['ventasmensuales'], minimo = productos['ventasmensuales'] )
c.groupby('codigodelproducto').agg({'promedio':'mean', 'maximo':'max','minimo':'min'}).reset_index()

   codigodelproducto  promedio  maximo  minimo
0                122    110.00     110     110
1                123     25.25      40       9
2                124     12.50      15      10
3                125     14.50      21       8
4                126     20.00      30      10
5                127     21.00      21      21

In [17]:
#C. Mínimo, Máximo y Promedio de ventas por producto con el formato
c = productos[['codigodelproducto','ventasmensuales']]
c = c.assign(promedio = productos['ventasmensuales'], maximo = productos['ventasmensuales'], minimo = productos['ventasmensuales'])
c.groupby('codigodelproducto').agg({'promedio':'mean', 'maximo':'max','minimo':'min'}).T

codigodelproducto    122    123   124   125   126   127
promedio           110.0  25.25  12.5  14.5  20.0  21.0
maximo             110.0  40.00  15.0  21.0  30.0  21.0
minimo             110.0   9.00  10.0   8.0  10.0  21.0

In [18]:
#E.Qué productos son provistos por los distintos fabricantes, indicando True/False con el siguiente formato:

c = productos[['codigodelproducto','codigofabricante']]
c = c.assign(value = True)
c
c.pivot_table(index='codigofabricante', columns='codigodelproducto', values='value').fillna(False)

codigodelproducto    122    123    124    125    126    127
codigofabricante
1                  False   True  False  False   True  False
2                   True   True   True   True  False   True
3                  False  False  False   True  False  False

# Ejercicio 4

4- Un sitio de Ebooks tiene información sobre los reviews que los usuarios hacen de sus libros en un DataFrame con formato (user_id, book_id, rating, timestamp). Por otro lado tenemos información en otro DataFrame que bajamos de GoodReads: (book_id, book_name, avg_rating). Podemos suponer que los Ids de los libros son compatibles. Se pide usar Python Pandas para:

    A. Obtener un DataFrame que indique el TOP5 de Ebooks en el sitio de Ebooks. (Para este punto se puede ignorar el segundo DataFrame).
    B. Obtener un DataFrame que indique qué libros tienen una diferencia de rating promedio mayor al 20% entre el sitio de Ebooks y GoodReads.

In [19]:
df_ebooks = pd.DataFrame(columns = ['user_id', 'book_id', 'rating', 'timestamp'])
df_goodreads = pd.DataFrame(columns = ['book_id', 'book_name', 'avg_rating'])
libros = ['Narnia', 'Mi Queso', 'Jesus', 'Data Mining', 'Colores']
for id_libro in range(len(libros)) :
    for j in range(3):
        df_ebooks = df_ebooks.append({
                        'user_id' : j + 200,
                        'book_id' : id_libro,
                        'rating' : random.uniform(0, 100),
                        'timestamp' : random.choice(['2017-8-1','2018-1-2','2019-9-4','2019-9-9'])
                    }, ignore_index = True)
    df_goodreads = df_goodreads.append({
                            'book_id' : id_libro,
                            'book_name' : libros[id_libro],
                            'avg_rating' : random.uniform(0, 100)
                        }, ignore_index = True)

In [20]:
df_ebooks.head(2)

  user_id book_id     rating timestamp
0     200       0  50.415327  2019-9-4
1     201       0  61.421600  2019-9-9

In [21]:
df_goodreads.head(2)

  book_id book_name  avg_rating
0       0    Narnia   97.888277
1       1  Mi Queso    2.432861

In [22]:
df_ebooks.nlargest(5, 'rating')

   user_id book_id     rating timestamp
6      200       2  99.395395  2019-9-9
11     202       3  95.012755  2019-9-9
9      200       3  86.994924  2018-1-2
4      201       1  83.141572  2019-9-4
5      202       1  80.794711  2017-8-1

In [23]:
df_ebooks = df_ebooks.groupby('book_id').agg({'rating':'mean'})
df_ebooks

            rating
book_id
0        50.647877
1        76.729107
2        59.738235
3        82.385787
4        45.139502

In [24]:
df_goodreads = df_goodreads.groupby('book_id').agg({'avg_rating':'mean'})
df_goodreads

         avg_rating
book_id
0         97.888277
1          2.432861
2         73.640387
3         30.217096
4         68.536134

In [25]:
merge = pd.merge(df_goodreads, df_ebooks, on='book_id', how='inner').diff(axis=1).drop(columns=['avg_rating']).applymap(lambda x: np.abs(x))
merge[merge['rating'] > 20]

            rating
book_id
0        47.240400
1        74.296246
3        52.168691
4        23.396632

# Ejercicio 5

5- La Agencia Nacional de Estadísticas de Buenos Aires recolecta información de nacimientos cuando los padres registran a sus hijos en el registro civil a partir de una encuesta. Esa información se encuentra disponible para su análisis en un csv con el siguiente formato (dia_nacimiento, mes_nacimiento, anio_nacimiento, peso_al_nacer, longitud_al_nacer, id_hospital, tipo_parto), donde el tipo de parto 1 es natural y 2 es cesárea. Por otro lado la agencia cuenta con información histórica de los hospitales en otro csv con siguiente formato (id_hospital, dirección, promedio_nacimientos_mensual). Se pide usar Pandas para:

    A. Calcular la cantidad de nacimientos para cada uno de los hospitales para el mes de Octubre de 2017 e indicar aquellos hospitales que superan el promedio de nacimientos mensuales.
    B. Comparando el mes de Octubre de 2017 indicar programáticamente si se incremento el % de cesáreas con respecto a ese mes del año 2016.

In [26]:
df_4_nacimientos_todos = pd.DataFrame(columns = ['dia_nacimiento', 'mes_nacimiento', 'anio_nacimiento','peso_al_nacer','longitud_al_nacer', 'id_hospital', 'tipo_parto'])
df_4_nacimientos_mensuales = pd.DataFrame(columns = ['id_hospital', 'direccion', 'promedio_nacimientos_mensual'])

for id_hospital in range(5):
    for _ in range(50):
        df_4_nacimientos_todos = df_4_nacimientos_todos.append({
                                    'dia_nacimiento' : random.randint(1,28),
                                    'mes_nacimiento' : random.randint(1,12),
                                    'anio_nacimiento' : random.randint(2016,2017),
                                    'peso_al_nacer' : random.uniform(1,5+1),
                                    'longitud_al_nacer' : random.uniform(0.30, 0.50),
                                    'id_hospital' : id_hospital,
                                    'tipo_parto' : random.randint(1,2)
                                }, ignore_index = True)
    df_4_nacimientos_mensuales = df_4_nacimientos_mensuales.append({
                                        'id_hospital' : id_hospital,
                                        'direccion' : ['direccion 1', 'direccion 2', 'direccion 3', 'direccion 4', 'direccion 5'][id_hospital],
                                        'promedio_nacimientos_mensual' : random.randint(1,5) 
                                    }, ignore_index = True)
df_4_nacimientos_todos = df_4_nacimientos_todos.astype({
        'dia_nacimiento' : int, 
        'anio_nacimiento' : int, 
        'mes_nacimiento' : int, 
        'id_hospital' : int, 
        'tipo_parto' : int
})
df_4_nacimientos_mensuales = df_4_nacimientos_mensuales.astype({
        'id_hospital' : int
})

In [27]:
df_4_nacimientos_mensuales

   id_hospital    direccion promedio_nacimientos_mensual
0            0  direccion 1                            2
1            1  direccion 2                            1
2            2  direccion 3                            1
3            3  direccion 4                            4
4            4  direccion 5                            3

In [28]:
df_4_nacimientos_todos

,dia_nacimiento,mes_nacimiento,anio_nacimiento,peso_al_nacer,longitud_al_nacer,id_hospital,tipo_parto
0,15,4,2016,1.461091,0.421711,0,2
1,27,6,2016,2.109530,0.451299,0,2
2,16,9,2016,2.299051,0.460530,0,2
3,13,8,2017,5.697064,0.438773,0,2
4,11,9,2017,5.302421,0.481559,0,1
...,...,...,...,...,...,...,...
245,20,11,2017,5.286797,0.433195,4,2
246,19,10,2016,5.885154,0.342701,4,1
247,27,8,2017,1.386925,0.387645,4,2
248,18,2,2017,2.818090,0.363510,4,1
249,19,12,2017,3.364475,0.433361,4,2

In [29]:
#A
oct_2017 = df_4_nacimientos_todos[df_4_nacimientos_todos['mes_nacimiento'] == 10].loc[df_4_nacimientos_todos['anio_nacimiento']==2017]

In [30]:
oct_2017['count'] = 1

In [31]:
a = oct_2017.groupby('id_hospital').agg({'count':'sum'})

In [32]:
a[a['count']>df_4_nacimientos_mensuales['promedio_nacimientos_mensual']].reset_index()

   id_hospital  count
0            0      4
1            1      4

In [33]:
#B
oct_2016 = df_4_nacimientos_todos[df_4_nacimientos_todos['mes_nacimiento'] == 10].loc[df_4_nacimientos_todos['anio_nacimiento']==2016]

In [34]:
(oct_2016.tipo_parto.value_counts(normalize=True)*100).get(2) < (oct_2017.tipo_parto.value_counts(normalize=True)*100).get(2)

True

# Ejercicio 6

6- El GCPD (Gotham City Police Dept) recolecta la información de casos policiales que acontecen en Ciudad Gótica. Esta información se encuentra guardada en un dataframe con el siguiente formato: (fecha, id_caso, descripcion, estado_caso, categoria, latitud, longitud). Los posibles estados que puede tener un caso son 1: caso abierto, 2: caso resuelto, 3: cerrado sin resolución. Las fechas se encuentran en el formato YYYY-MM-DD. Por otro lado el comisionado Gordon guarda un registro detallado sobre en cuáles casos fue activada la batiseñal para pedir ayuda del vigilante, Batman. Esta información se encuentra en un Dataframe con el siguiente formato (id_caso, respuesta), siendo campo respuesta si la señal tuvo una respuesta positiva (1) o negativa (0) de parte de él El sector encargado de las estadísticas oficiales del GCPD quiere con esta información analizar las siguientes situaciones:

    A. Tasa de resolución de casos de la fuerza policial por categoría de caso (considerando aquellos casos en los que no participó Batman).
    B. Tasa de resolución de casos con la ayuda de Batman (considerando que aquellos casos en los que fue llamado con la batiseñal, participó en la resolución).
    C. Indicar el mes del año pasado en el que Batman tuvo mayor participación en la investigación de casos.

In [35]:
df_6_policia = pd.DataFrame(columns = ['fecha', 'id_caso', 'descripcion', 'estado_caso', 'categoria', 'latitud', 'longitud'])
df_6_gordon = pd.DataFrame(columns = ['id_caso', 'respuesta'])
for id_caso in range(50):
    df_6_policia = df_6_policia.append({
                    'fecha' : "{}-{}-{}".format(random.choice(['2018', '2019']), random.randint(1,12), random.randint(1,31)),
                    'id_caso' : id_caso, 
                    'descripcion' : "...", 
                    'estado_caso' : random.choice(['caso abierto', 'caso cerrado', 'caso cerrado sin resolver']),
                    'categoria' : random.randint(1,5),
                    'latitud' : random.uniform(-90, 90),
                    'longitud' : random.uniform(0, 360)
                }, ignore_index = True)
    df_6_gordon = df_6_gordon.append({
                    'id_caso' : id_caso,
                    'respuesta' : random.choice([1, 0])
                }, ignore_index = True)

In [36]:
df_6_gordon.head()

  id_caso respuesta
0       0         0
1       1         1
2       2         1
3       3         1
4       4         1

In [37]:
df_6_policia.head()

,fecha,id_caso,descripcion,estado_caso,categoria,latitud,longitud
0,2018-11-15,0,...,caso cerrado,5,61.689704,232.240924
1,2018-3-2,1,...,caso cerrado sin resolver,5,-76.903870,71.229276
2,2018-2-15,2,...,caso cerrado sin resolver,2,60.932431,223.576237
3,2019-2-28,3,...,caso cerrado,2,19.191850,194.499178
4,2019-6-23,4,...,caso cerrado sin resolver,1,-77.859972,82.448025

In [38]:
m = pd.merge(df_6_gordon,df_6_policia, on='id_caso')

In [39]:
m.head()

,id_caso,respuesta,fecha,descripcion,estado_caso,categoria,latitud,longitud
0,0,0,2018-11-15,...,caso cerrado,5,61.689704,232.240924
1,1,1,2018-3-2,...,caso cerrado sin resolver,5,-76.903870,71.229276
2,2,1,2018-2-15,...,caso cerrado sin resolver,2,60.932431,223.576237
3,3,1,2019-2-28,...,caso cerrado,2,19.191850,194.499178
4,4,1,2019-6-23,...,caso cerrado sin resolver,1,-77.859972,82.448025

In [40]:
m[m["respuesta"] == 0].estado_caso.value_counts(normalize=True).get("caso cerrado")

0.2608695652173913

In [41]:
m[m["respuesta"] == 1].estado_caso.value_counts(normalize=True).get("caso cerrado")

0.37037037037037035

In [42]:
m['fecha'] = pd.to_datetime(m['fecha'])

In [43]:
a = m[m['fecha'].dt.year == 2018].loc[m['respuesta'] == 1]
a

,id_caso,respuesta,fecha,descripcion,estado_caso,categoria,latitud,longitud
1,1,1,2018-03-02,...,caso cerrado sin resolver,5,-76.903870,71.229276
2,2,1,2018-02-15,...,caso cerrado sin resolver,2,60.932431,223.576237
5,5,1,2018-09-12,...,caso abierto,1,24.929260,294.390906
6,6,1,2018-09-15,...,caso cerrado,3,17.595503,111.880195
7,7,1,2018-03-29,...,caso cerrado,3,-8.149386,96.263581
18,18,1,2018-05-11,...,caso abierto,2,66.408719,148.823718
22,22,1,2018-05-26,...,caso cerrado sin resolver,2,85.496498,109.465361
33,33,1,2018-12-20,...,caso cerrado sin resolver,1,-20.292259,326.257659
38,38,1,2018-08-15,...,caso abierto,1,44.683508,277.331284
44,44,1,2018-10-10,...,caso cerrado,5,49.828928,277.397454
49,49,1,2018-12-05,...,caso cerrado sin resolver,2,-0.001566,349.776283

In [44]:
a = a.assign(count = 1)
a.groupby(m['fecha'].dt.month).agg({'count':'sum'}).nlargest(1,'count').reset_index().rename(columns={'fecha':'mes', 'count':'cantidad'})

   mes  cantidad
0    3         2


# Ejercicio 7

7- Dada la exitosa convocatoria de los Juegos Olímpicos de la Juventud por parte del público, sus organizadores realizan distintos análisis para planificar las jornadas finales del certamen. Es por ello que cuentan con información en los siguientes archivos csv:

    eventos.csv
        (id_evento, fecha, id_locacion, nombre_evento, id_categoria_deportiva, cantidad_espectadores)

    locacion.csv
        (id_locacion, nombre, capacidad, capacidad_extendida, sede, latitud, longitud)

    categorias_deportivas.csv
        (id_categoria_deportiva, nombre, año_de_adopcion)

El primer archivo cuenta con información de los eventos, indicando la fecha (en formato “YYYY-mm-dd hh:mm:ss”), el lugar donde ocurrió (id_locacion) y la cantidad de espectadores que asistieron. Además se aporta información sobre la categoría deportiva a la cual pertenece el evento. Por otro lado se tiene información sobre las distintas locaciones en la sedes del certamen en las que ocurrieron los eventos. Contamos con información de su capacidad total de espectadores así como de su capacidad extendida (cuantos asientos extras se pueden brindar sobre la capacidad de la locación). Se desea obtener:

    A. Nombre de la sede que acumuló la mayor cantidad de espectadores en eventos durante el certamen del 14 al 15 de octubre inclusive. Esto es de vital importancia para distribuir el merchandising oficial del evento, para las fechas finales.
    B. Nombre del evento y nombre de la categoría deportiva de aquellos eventos cuya cantidad de espectadores superó la capacidad de la locación, más allá de la capacidad extendida. Esto es de vital importancia para detectar problemas de seguridad o si es necesario realizar algún cambio de locación.

In [45]:
df_7_eventos = pd.DataFrame(columns = ['id_evento', 'fecha', 'id_locacion', 'nombre_evento', 'id_categoria_deportiva', 'cantidad_espectadores'])
df_7_locacion = pd.DataFrame(columns = ['id_locacion', 'nombre', 'capacidad', 'capacidad_extendida', 'sede', 'latitud', 'longitud'])
df_7_categ_depor = pd.DataFrame(columns = ['id_categoria_deportiva', 'nombre', 'año_de_adopcion'])

for i in range(50):
    df_7_eventos = df_7_eventos.append({
                        'id_evento' : i, 
                        'fecha' : "{}-{}-{} {}:{}:{}".format(
                                        2019, 
                                        10, 
                                        random.randint(14,15),
                                        random.randint(0,23),
                                        random.randint(0,59),
                                        random.randint(0,59)
                                    ), 
                        'id_locacion': i, 
                        'nombre_evento' : 'nombre {}'.format(i), 
                        'id_categoria_deportiva' : i, 
                        'cantidad_espectadores' : random.randint(0, 500)
                    }, ignore_index = True)
    df_7_locacion = df_7_locacion.append({
                        'id_locacion' : i, 
                        'nombre' : 'nombre sede {}'.format(i), 
                        'capacidad' : random.randint(100, 300), 
                        'capacidad_extendida' : random.randint(50, 100), 
                        'sede': i, 
                        'latitud' : random.uniform(-90,90), 
                        'longitud' : random.uniform(0,360)
                    }, ignore_index = True)
    df_7_categ_depor = df_7_categ_depor.append({
        'id_categoria_deportiva' : i , 
        'nombre' : 'nombre categoria {}'.format(i), 
        'año_de_adopcion' : random.choice(['1997', '1999', '2001'])
    }, ignore_index = True) 
df_7_eventos['fecha'] = pd.to_datetime(df_7_eventos['fecha'], format = "%Y-%m-%d %H:%M:%S")
df_7_eventos['cantidad_espectadores'] = pd.to_numeric(df_7_eventos['cantidad_espectadores'])
# Darle ctrl-enter hasta hayar una cobinacion de fechas validas
df_7_eventos.head()

,id_evento,fecha,id_locacion,nombre_evento,id_categoria_deportiva,cantidad_espectadores
0,0,2019-10-14 11:44:01,0,nombre 0,0,108
1,1,2019-10-15 20:13:51,1,nombre 1,1,267
2,2,2019-10-14 10:49:23,2,nombre 2,2,304
3,3,2019-10-14 09:16:21,3,nombre 3,3,336
4,4,2019-10-15 21:44:08,4,nombre 4,4,105